{
	"EOObjectNotAvailableException" = "Este objeto não foi encontrado no banco de dados. Ele provavelmente foi apagado por outra pessoa.";
	"ExceedsMaximumLengthException" = "O valor inserido para <b>@@displayNameForProperty@@</b> excede o tamanho de <b>@@attribute.width@@</b>.";
	"InvalidNumberException" = "O valor é um inteiro não é válido.";
	"InvalidValueException" = "O valor inserido para <b>@@displayNameForEntity@@</b> não é válido.";
	"MandatoryToManyRelationshipException" = "Um(a) <b>@@displayNameForEntity@@</b> precisa ter ao menos um(a) <b>@@displayNameForProperty@@</b>.";
	"MandatoryToOneRelationshipException" = "Um(a) <b>@@displayNameForEntity@@</b> precisa ter ao menos um(a <b>@@displayNameForProperty@@</b>.";
	"NullPropertyException" = "Por favor providencie um(a) <b>@@displayNameForProperty@@</b>.";
	"ObjectRemovalException" = "Não foi possível apagar <b>@@displayNameForEntity@@</b>. Você precisa primeiro apagar o item em seu(sua) <b>@@displayNameForProperty@@</b>";
	"ObjectsRemovalException" = "Não foi possível apagar <b>@@displayNameForEntity@@</b>. Você precisa primeiro apagar o item em seu(sua) <b>@@displayNameForProperty@@</b>.";
	"Test validation message for unit test" = "FALHA - ERD vem antes disto";
	"Test validation message for unit test in ERX" = "SUCCESSO - ERD vem antes disto";
	"ValueConversionException" = "O valor inserido para <b>@@displayNameForProperty@@</b> não é válido <b>@@attribute.valueClass@@</b>.";
	"UniquenessViolationNewObject" = "<b>@@displayNameForEntity@@</b> com esta(e) <b>@@displayNameForProperty@@</b> já existe.";
	"UniquenessViolationExistingObject" = "<b>@@displayNameForEntity@@</b> com esta(e) <b>@@displayNameForProperty@@</b> já existe.";
}
